13/data/attachments/41ba8fdcdd1d6461.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_0232ad7c-2ccc-4791-97d9-65ae1a51084c</nif:username>
            <nif:friendToBeAdded>Ashley_in_Friend_91708_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>